app/controllers/users_controller.rb

  def create
  @user=User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "mail", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "egerh"], ["mail", "ehehr"], ["created_at", "2015-05-27 23:40:58.272160"], ["updated_at", "2015-05-27 23:40:58.272160"]]

  def update
    @user=User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "mail" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "rehrthwrtj"], ["mail", "hjwrtjrj"], ["updated_at", "2015-05-28 18:58:28.185631"], ["id", 1]]